# config.py
import os
from pathlib import Path
from dotenv import load_dotenv

BASE_DIR = Path(__file__).resolve().parent
LOG_DIR = BASE_DIR / "logs"
LOG_DIR.mkdir(exist_ok=True)
LOG_FILE = LOG_DIR / "app.log"

load_dotenv()

TOKEN = os.getenv('TOKEN')
GROQ_API_KEY = os.getenv("GROQ_API_KEY")
OWNER_ID = int(os.getenv('OWNER_ID', 0))

raw_admin_ids = os.getenv('ADMIN_IDS', '')
ADMIN_IDS = [int(id.strip()) for id in raw_admin_ids.split(',') if id.strip()]
if OWNER_ID not in ADMIN_IDS: ADMIN_IDS.append(OWNER_ID)

# Weather Defaults
DEFAULT_LAT = 51.4982
DEFAULT_LON = 31.2893
DEFAULT_CITY = os.getenv('DEFAULT_CITY', 'Chernihiv')

# RSS Config
raw_feeds = os.getenv('RSS_FEEDS', '')
RSS_FEEDS = [url.strip() for url in raw_feeds.split(',') if url.strip()]

# Fitness activitys
FITNESS_PLAN = {
    0: (
        "🏗 <b>Понеділок: Upper Frame & Width (Плечі та Крила)</b>\n"
        "<i>Акцент на розширення рами.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        
        """• 🧗‍♂️ <b>Підтягування (Широкий хват):</b> 3-4 підходи на максимальну кількість якісних повторів. 
        (Контролюй розтягнення найширших у нижній точці).\n"""
        
        """• 🧗‍♂️ <b>Підтягування (Вузький паралельний або зворотний хват):
        </b> 2 підходи. Це дасть пікову товщину біцепсу та середині спини.\n"""
        
        "• 🤸‍♂️ <b>Планка на витягнутих руках:</b> 2 підходи по 60 секунд. (Стабілізація плечового поясу).\n"
    ),
    1: (
        "👣 <b>Вівторок: Hypertrophy Base (Ноги — Об'єм)</b>\n"
        "<i>Робота під годинник. Мета — гормональний сплеск.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• 🦵 <b>Присідання:</b> 100 повторів. Схема: 4 підходи по 25. Темп середній, чітко під метроном.)\n"

        """• 🪞 <b>Догляд:</b> Маска (Обличчя + Голова). Опара з блендера. 
        Поки кров «кипить» після присідань — ідеальний час.\n"""
    ),
    2: (
        "🧱 <b>Середа: Metabolic Recovery</b>\n"
        "<i>СРозвантаження ЦНС після ніг.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• 🚴‍♀️ <b>Велосипед (лежачи):</b> 3 підходи по 60 секунд. Акцент на витривалість стегна.\n"
        "• 🧘‍♂️ <b>Розтяжка:</b> 5-10 хвилин на м'язи ніг та спини.\n"
        "• 🛁 <b>Core:</b> Вакуум (3-5 підходів) — тримаємо 81 см.\n"
    ),
    3: (
        "🦿 <b>Четвер: Strength & Detail</b>\n"
        "<i>Сила та Гомілка.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• 🧗‍♂️ <b>Підтягування (Класичний хват):</b> 3 підходи. Спробуй «драбинку» або додавай паузу у верхній точці.\n"
        "• 🦿 <b>Гомілка (Calf Press):</b> 125 підйомів. Різні кути стоп (носки всередину, прямо, назовні)."
    ),
    4: (
        "🔥 <b>П'ятниця: The Extreme Finisher (Ноги — Виснаження)</b>\n"
        "<i>Авторський алгоритм для максимального росту бази..</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• ⛹️‍♂️ <b>Випади:</b> 2 підходи по 15 на кожну ногу <i>(спочатку, поки свіжа ЦНС)</i>\n"
        "• 🦵 <b>Присідання (Блок):</b> 4 підходи по 20 повторів.\n"
        "• 🦿 <b>Гомілка:</b> 5 підходів по 25 (безперервний цикл, різна геометрія).\n"
        "• 🪞 <b>Догляд:</b> Маска (face)\n"
    ),
    5: (
        "🌳 <b>Субота: Day Off / Long Walk</b>\n"
        "<i>Вихідний від коду і заліза.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• 🍔 <b>Харчування:</b> максимум білка\n"
    ),
    6: (
        "🛠 <b>Неділя: Maintenance</b>\n"
        "<i>Підготовка до релізу нового тижня.</i>\n\n"
        "• 🌬 <b>Вакуум:</b> 5 підходів по 15-20 сек\n"
        "• 💆‍♂️ Легка активність за бажанням\n"
        "• 🍳 <b>Ревізія холодильника:</b> звари яйця, наріж курку (білок на завтра)."
    )
}

HYDRATION_MESSAGES = [
    "💧 Час залити охолоджуючу рідину (H2O).",
    "🥤 Суглоби самі себе не змастять. Пий воду.",
    "🚰 Перерва на гідратацію. Нирки скажуть спасибі.",
    "🌊 Рівень рідини в системі низький. Поповни баланс.",
    "🧊 Ковток води — і мозок працює краще."
]

